app/controllers/application_controller.rb

    def authenticate
        @current_user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]