app/controllers/friendships_controller.rb

    def index
        @friendships = Friendship.all
---
SELECT "friendships".* FROM "friendships"