app/controllers/reviews_controller.rb

    def create
        @review = Review.create(review_params)
---
INSERT INTO "reviews" ("user_id", "movie_id", "content", "personal_rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 7], ["movie_id", 64], ["content", "Monke"], ["personal_rating", 1], ["created_at", "2021-10-19 14:24:59.742920"], ["updated_at", "2021-10-19 14:24:59.742920"]]