app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def login
        render json: User.first

INSERT INTO "users" ("username", "password_digest", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def signup
        @user = User.create(username: params[:username], password: params[:password], avatar: params[:avatar])

INSERT INTO "users" ("username", "password_digest", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def signup
        @user = User.create(username: params[:username], password: params[:password], avatar: params[:avatar])